Tekla.Structures.AutoDirectionTypeEnum
The auto direction type defines how a connection or detail coordinate system will be oriented automatically.

Tekla.Structures.AutoDirectionTypeEnum.AUTODIR_NA
The auto direction will not be available.

Tekla.Structures.AutoDirectionTypeEnum.AUTODIR_BASIC
The auto direction type for usual joints will be used.

Tekla.Structures.AutoDirectionTypeEnum.AUTODIR_DIAGONAL
The auto direction type for diagonal joints will be used.

Tekla.Structures.AutoDirectionTypeEnum.AUTODIR_SPLICE
The auto direction type for splices will be used.

Tekla.Structures.AutoDirectionTypeEnum.AUTODIR_DETAIL
The auto direction type for details will be used.

Tekla.Structures.AutoDirectionTypeEnum.AUTODIR_GLOBAL_Z
The auto direction type with joint direction at the global Z will be used.

Tekla.Structures.AutoDirectionTypeEnum.AUTODIR_SEATING
The auto direction type for seating joints will be used.

Tekla.Structures.AutoDirectionTypeEnum.AUTODIR_PRIMARY_X
The auto direction type with joint direction parallel to the primary X-axis will be used.

Tekla.Structures.AutoDirectionTypeEnum.AUTODIR_FROM_ATTRIBUTE_FILE
The auto direction type is fetched from the loaded attribute file.